# Module 2 - Relational Databases

ANDREA FRANCO C0931897

SQL - Structured Query Language
SQL DBs have two or more tables with columns and rows

**Used for**
* Execute queries
* CRUD operations

## SQLite

Serverless database: no need to connect with a server to connect with python and most of the languages

In [1]:
# import
import sqlite3

# create connection (this works like the cable to connect the db with python)
conn = sqlite3.connect('example.db')

In [2]:
# cursor works like a basket to carry objects from the db to python and likewise
cursor = conn.cursor()

In [3]:
# Write the querie to create the table (the oranges)
sql = '''CREATE TABLE EMPLOYEE(
    FIRST_NAME  CHAR(20) NOT NULL,
    LAST_NAME   CHAR(20),
    AGE         INT      NOT NULL,
    SEX         CHAR(1),
    INCOME      FLOAT)'''

# Execute the querie (put the oranges in the basket that is already hanging from the line)
cursor.execute(sql)

# Push the basket into the other side
conn.commit()

In [4]:
# print the current tables
print_table = """
PRAGMA table_info(EMPLOYEE) """

cursor.execute(print_table)

conn.commit()

print(cursor.fetchall())

[(0, 'FIRST_NAME', 'CHAR(20)', 1, None, 0), (1, 'LAST_NAME', 'CHAR(20)', 0, None, 0), (2, 'AGE', 'INT', 1, None, 0), (3, 'SEX', 'CHAR(1)', 0, None, 0), (4, 'INCOME', 'FLOAT', 0, None, 0)]

In [5]:
print_table_name = '''
SELECT FIRST_NAME FROM EMPLOYEE'''

cursor.execute(print_table_name)

conn.commit()

print(cursor.fetchall())

[]

### Transform a table into a pandas dataframe

In [6]:
import pandas as pd

In [7]:
db = pd.read_sql('SELECT * FROM EMPLOYEE', conn)

In [8]:
print(db)

Empty DataFrame
Columns: [FIRST_NAME, LAST_NAME, AGE, SEX, INCOME]
Index: []

### Insert values

In [9]:
cursor.execute('''INSERT INTO EMPLOYEE(FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES
               ('Ramya','Rama Priya', 27, 'F', 9000), 
               ('Sharukh','Sheik', 25, 'M', 8300),
               ('Sarmista', 'Sharma', 26, 'F', 10000),
               ('Sharukh', 'Sheik', 25, 'M', 8300),
               ('Sharukh', 'Sheik', 25, 'M', 8300),
               ('Sarmista', 'Sharma', 26, 'F', 10000)''')

conn.commit()

In [10]:
cursor.execute('''
SELECT * FROM EMPLOYEE''')

conn.commit()

print(cursor.fetchall())

[('Ramya', 'Rama Priya', 27, 'F', 9000.0), ('Sharukh', 'Sheik', 25, 'M', 8300.0), ('Sarmista', 'Sharma', 26, 'F', 10000.0), ('Sharukh', 'Sheik', 25, 'M', 8300.0), ('Sharukh', 'Sheik', 25, 'M', 8300.0), ('Sarmista', 'Sharma', 26, 'F', 10000.0)]

In [11]:
cursor.execute('''INSERT INTO EMPLOYEE(FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES
               ('Andrea','Franco', 24, 'F', 10000), 
               ('Andres','Urbano', 24, 'M', 8000),
               ('Mike', 'Wasazki', 30, 'M', 10000),
               ('Jason', 'Sullivan', 31, 'M', 12000)''')

conn.commit()

In [12]:
cursor.execute('''
SELECT * FROM EMPLOYEE''')

conn.commit()

print(cursor.fetchall())

[('Ramya', 'Rama Priya', 27, 'F', 9000.0), ('Sharukh', 'Sheik', 25, 'M', 8300.0), ('Sarmista', 'Sharma', 26, 'F', 10000.0), ('Sharukh', 'Sheik', 25, 'M', 8300.0), ('Sharukh', 'Sheik', 25, 'M', 8300.0), ('Sarmista', 'Sharma', 26, 'F', 10000.0), ('Andrea', 'Franco', 24, 'F', 10000.0), ('Andres', 'Urbano', 24, 'M', 8000.0), ('Mike', 'Wasazki', 30, 'M', 10000.0), ('Jason', 'Sullivan', 31, 'M', 12000.0)]

### Read

* fetchone() -> To fetch the next row. If you execute it once, its the first row, second one, second row, etc.
* fetchmany() -> you have to specify how many
* fetchall() -> fetch all

In [13]:
cursor.execute('''SELECT * from EMPLOYEE''')
result = cursor.fetchone()
print(result)
result = cursor.fetchone()
print(result)

('Ramya', 'Rama Priya', 27, 'F', 9000.0)
('Sharukh', 'Sheik', 25, 'M', 8300.0)

In [14]:
cursor.execute('''SELECT * from EMPLOYEE''')
result = cursor.fetchmany(7)
print(result)

[('Ramya', 'Rama Priya', 27, 'F', 9000.0), ('Sharukh', 'Sheik', 25, 'M', 8300.0), ('Sarmista', 'Sharma', 26, 'F', 10000.0), ('Sharukh', 'Sheik', 25, 'M', 8300.0), ('Sharukh', 'Sheik', 25, 'M', 8300.0), ('Sarmista', 'Sharma', 26, 'F', 10000.0), ('Andrea', 'Franco', 24, 'F', 10000.0)]

In [15]:
result = cursor.fetchall()
print(result)

[('Andres', 'Urbano', 24, 'M', 8000.0), ('Mike', 'Wasazki', 30, 'M', 10000.0), ('Jason', 'Sullivan', 31, 'M', 12000.0)]

We need to "fill the basket again" in order to get the same result. We need to execute the SELECT querie again.

In [16]:
result = cursor.fetchone()
print(result)

None

### Update

In [17]:
sql = """ UPDATE EMPLOYEE SET AGE=AGE+1 WHERE SEX = 'M' """
cursor.execute(sql)
conn.commit()
cursor.fetchall()

[]

In [18]:
sql = """ UPDATE EMPLOYEE SET LAST_NAME=NULL"""
cursor.execute(sql)
conn.commit()

In [19]:
cursor.execute('''SELECT * from EMPLOYEE''')
result = cursor.fetchall()
print(result)

[('Ramya', None, 27, 'F', 9000.0), ('Sharukh', None, 26, 'M', 8300.0), ('Sarmista', None, 26, 'F', 10000.0), ('Sharukh', None, 26, 'M', 8300.0), ('Sharukh', None, 26, 'M', 8300.0), ('Sarmista', None, 26, 'F', 10000.0), ('Andrea', None, 24, 'F', 10000.0), ('Andres', None, 25, 'M', 8000.0), ('Mike', None, 31, 'M', 10000.0), ('Jason', None, 32, 'M', 12000.0)]

In [20]:
sql = """ ALTER TABLE EMPLOYEE RENAME LAST_NAME to FAMILY_NAME"""
cursor.execute(sql)
conn.commit()

In [21]:
cursor.execute('''PRAGMA table_info(EMPLOYEE)''')
result = cursor.fetchall()
print(result)

[(0, 'FIRST_NAME', 'CHAR(20)', 1, None, 0), (1, 'FAMILY_NAME', 'CHAR(20)', 0, None, 0), (2, 'AGE', 'INT', 1, None, 0), (3, 'SEX', 'CHAR(1)', 0, None, 0), (4, 'INCOME', 'FLOAT', 0, None, 0)]

### Duplicate income column called income2

In [22]:
sql = """ ALTER TABLE EMPLOYEE ADD INCOME2 FLOAT"""
cursor.execute(sql)
conn.commit()

In [23]:
sql = """UPDATE EMPLOYEE SET INCOME2 = INCOME"""
cursor.execute(sql)
conn.commit()

In [24]:
cursor.execute('''PRAGMA table_info(EMPLOYEE)''')
result = cursor.fetchall()
print(result)

[(0, 'FIRST_NAME', 'CHAR(20)', 1, None, 0), (1, 'FAMILY_NAME', 'CHAR(20)', 0, None, 0), (2, 'AGE', 'INT', 1, None, 0), (3, 'SEX', 'CHAR(1)', 0, None, 0), (4, 'INCOME', 'FLOAT', 0, None, 0), (5, 'INCOME2', 'FLOAT', 0, None, 0)]

Rename it to EMPLOYEE_INCOME

In [25]:
sql = """ ALTER TABLE EMPLOYEE RENAME INCOME2 to EMPLOYEE_INCOME"""
cursor.execute(sql)
conn.commit()

In [26]:
cursor.execute('''PRAGMA table_info(EMPLOYEE)''')
result = cursor.fetchall()
print(result)

[(0, 'FIRST_NAME', 'CHAR(20)', 1, None, 0), (1, 'FAMILY_NAME', 'CHAR(20)', 0, None, 0), (2, 'AGE', 'INT', 1, None, 0), (3, 'SEX', 'CHAR(1)', 0, None, 0), (4, 'INCOME', 'FLOAT', 0, None, 0), (5, 'EMPLOYEE_INCOME', 'FLOAT', 0, None, 0)]

### Create a duplicate table and name it as my name

In [27]:
cursor.execute('''PRAGMA table_info(Andrea)''')
result = cursor.fetchall()
print(result)

[]

In [28]:
sql = """ CREATE TABLE Andrea AS SELECT * FROM EMPLOYEE;"""
cursor.execute(sql)
conn.commit()

### Delete income column

In [29]:
cursor.execute('''PRAGMA table_info(Andrea)''')
result = cursor.fetchall()
print(result)

[(0, 'FIRST_NAME', 'TEXT', 0, None, 0), (1, 'FAMILY_NAME', 'TEXT', 0, None, 0), (2, 'AGE', 'INT', 0, None, 0), (3, 'SEX', 'TEXT', 0, None, 0), (4, 'INCOME', 'REAL', 0, None, 0), (5, 'EMPLOYEE_INCOME', 'REAL', 0, None, 0)]

In [30]:
sql = """ ALTER TABLE Andrea DROP COLUMN EMPLOYEE_INCOME"""
cursor.execute(sql)
conn.commit()

In [31]:
cursor.execute("SELECT sqlite_version()")
version = cursor.fetchone()[0]
print(f"SQLite version: {version}")

SQLite version: 3.42.0

### Drop table employee

In [32]:
sql = """ DROP TABLE EMPLOYEE"""
cursor.execute(sql)
conn.commit()

# MongoDB

Server database